tempDirs/tmp5302y4sz/0/kineticenergy
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0";
 object kineticenergy;
}

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform 0.375;

boundaryField
{
  bedWall
  {
    type kqRWallFunction;
    value $internalField;
    Ks uniform 0.007162769059317429;
    Cs uniform 0.5;
    roughnessHeight 0.007162769059317429;
    roughnessConstant 0.5;
    roughnessFactor 1;
  }
  leftSide
  {
    type kqRWallFunction;
    value $internalField;
    Ks uniform 0.007162769059317429;
    Cs uniform 0.5;
    roughnessHeight 0.007162769059317429;
    roughnessConstant 0.5;
    roughnessFactor 1;
  }
  rightSide
  {
    type kqRWallFunction;
    value $internalField;
    Ks uniform 0.007162769059317429;
    Cs uniform 0.5;
    roughnessHeight 0.007162769059317429;
    roughnessConstant 0.5;
    roughnessFactor 1;
  }
  freeSurface
  {
    type zeroGradient;
  }
  inletWater
  {
    type fixedValue;
    value uniform 0.3;
  }
  outletWater
  {
    type zeroGradient;
  }
  defaultFaces
  {
    type empty;
  }
} 	// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

